[{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/ASME-Medal\",\"ASME Medal\")","source":"ASME","eligibility":"ASME Medal, established in 1920, is the highest award that the Society can bestow and is to recognize “eminently distinguished engineering achievement.” Only one ASME Medal may be awarded annually. Although some individuals have been honored by both the ASME Medal and Honorary Membership, each award has been made on the basis of different accomplishments.","deadline":"March 1"},{"award":"=HYPERLINK(\"https://www.asme.org/about-asme/honors-awards/achievement-awards/adaptive-structures-material-systems-award\",\"Adaptive Structures and Material Systems Award\")","source":"ASME","eligibility":"The Adaptive Structures and Material Systems Award recognizes significant contributions to the sciences and technologies associated with adaptive structures and/or materials systems. The award is intended to honor a lifetime of achievement and sustained impact in the field and is given only to a senior researcher.","deadline":"December 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Allan-Kraus-Thermal-Management-Medal\",\"Allan Kraus Thermal Management Medal\")","source":"ASME","eligibility":"The Allan Kraus Thermal Management Medal, recognizes an individual who has demonstrated outstanding achievements in thermal management of electronic systems and his or her commitment to the field of thermal science and engineering.","deadline":"February 15"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Literature-Awards/Arthur-L-Williston-Medal\",\"Arthur L. Williston Medal\")","source":"ASME","eligibility":"The Arthur L. Williston Medal recognizes an engineering student or recent graduate for “fostering civic service.”","deadline":"February 15"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Barnett-Uzgiris-Product-Safety-Award\",\"Barnett-Uzgiris Product Safety Design Award\")","source":"ASME","eligibility":"The Award recognizes individuals who have made significant contributions to the safe design of products through teaching, research, and professional accomplishments.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Ben-C-Sparks-Medal\",\"Ben C. Sparks Medal\")","source":"ASME","eligibility":"The award was established in 1990 in memory of Ben C. Sparks, a devoted member of ASME and a dedicated teacher of mechanical engineering technology and mechanical engineering. It was endowed by student section contributions and contributions from industry, the engineering education community and groups within the Society.","deadline":"September 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Bergles-Rohsenow-Young-Investigator-Award-in-Heat\",\"Bergles-Rohsenow Young Investigator Award in Heat Transfer\")","source":"ASME","eligibility":"The Bergles-Rohsenow Young Investigator Award in Heat Transfer is given to a young engineer that is under 36 years of age and has received a Ph.D. or equivalent degree in Engineering. The individual must be committed to pursuing research in heat transfer, and must have demonstrated the potential to make significant contributions to the field of heat transfer. Such contributions may take the form of, but are not limited to, analytical/numerical methods, equipment/instrumentation, or experimentation - any of which should lead to peer-reviewed publications.","deadline":"October 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Bernard-F-Langer-Nuclear-Codes-Standards-Award\",\"Bernard F. Langer Nuclear Codes and Standards Award\")","source":"ASME","eligibility":"The Bernard F. Langer Nuclear Codes and Standards Award was established in 1977 in honor of B.F. Langer who was instrumental in the development of the rules for nuclear vessels.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Literature-Awards/Blackall-Machine-Tool-and-Gage-Award\",\"Blackall Machine Tool and Gage Award\")","source":"ASME","eligibility":"The Blackall Machine Tool and Gage Award is presented for the best current original paper or papers (not published elsewhere) which has/have been presented before ASME and/or published by ASME during the two calendar years immediately preceding the year of the award. The paper(s) should clearly demonstrate that the science and engineering technologies outlined in the paper, resulted in a significant contribution to the manufacturing processes and systems for the design or application of machine tools, gauges, dimensional measuring instruments, or new manufacturing technologies and metrology approaches.","deadline":"December 15"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Burt-L-Newkirk-Award\",\"Burt L. Newkirk Award\")","source":"ASME","eligibility":"The Burt L. Newkirk Award is given to an individual who has not passed his/her fortieth birthday on July 1 of the year in which the award is conferred and who is an ASME member at the time of nomination. It is given to one who has made notable contributions to the field of tribology in research or development as evidenced by important tribology publications.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Charles-Russ-Richards-Memorial-Award\",\"Charles Russ Richards Memorial Award\")","source":"ASME","eligibility":"In 1938, Pi Tau Sigma (National Mechanical Engineering Honor Society) arranged with ASME for the joint award of the Pi Tau Sigma Gold Medal. This medal is awarded for outstanding achievement in mechanical engineering to an engineer within ten years after graduation from the regular engineering course of a recognized college or university.","deadline":"February 15"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Charles-T-Main-Student-Section-Awards\",\"Charles T. Main Student Leadership Award\")","source":"ASME","eligibility":"\n","deadline":"mckivorf@asme.org"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Daniel-C-Drucker-Medal\",\"Daniel C. Drucker Medal\")","source":"ASME","eligibility":"The Daniel C. Drucker medal was established in 1997 and is conferred in recognition of distinguished contributions to the field of applied mechanics and mechanical engineering through research, teaching and service to the community over a substantial period of time.","deadline":"September 15th"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Dixy-Lee-Ray-Award\",\"Dixy Lee Ray Award\")","source":"ASME","eligibility":"The Dixy Lee Ray Award, established in 1998, recognizes significant achievements and contributions in the broad field of environmental protection. As a general rule, in alternate years achievement in the following areas will be recognized: environmental engineering, including environmental technology and related topics; other environmental areas, including environmental health, environmental sciences, environmental management and policy, and related topics.","deadline":"February 15"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Service-Awards/Dedicated-Service-Award\",\"Dedicated Service Award\")","source":"ASME","eligibility":"In 1983, the ASME Board of Governors approved the establishment of the ASME Dedicated Service Award (DSA). It honors unusual dedicated voluntary service to the Society marked by outstanding performance, demonstrated effective leadership, prolonged and committed service, devotion, enthusiasm and faithfulness. The award may be presented to selected individuals who have served the Society for at least ten years in one or more of the following areas: Standards and Certification; Public Affairs & Outreach; Technical Events and Content; Student & Early Career Development; Board of Governors; ASME Foundation; and The ASME Auxiliary, Inc.","deadline":"December 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Literature-Awards/Edward-F-Obert-Award\",\"Edward F. Obert Award\")","source":"ASME","eligibility":"Nomination Instructions","deadline":"March 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Edwin-F-Church-Medal\",\"Edwin F. Church Medal\")","source":"ASME","eligibility":"The Edwin F. Church Medal, established in 1972, is awarded to an individual who has rendered eminent service in increasing the value, importance and attractiveness of mechanical engineering education. Education is used here in its broadest sense of preparation for any aspect or level of mechanical engineering through any appropriate mechanism including universities, technical institutes, professional society educational activities, continuing education programs of professional societies and private groups, in-house professional development programs of industrial concerns and governmental agencies, programmed learning and self-instruction systems.","deadline":"Church Medal Committee Chair"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Fluids-Engineering-Award\",\"Fluids Engineering Award\")","source":"ASME","eligibility":"The Fluids Engineering Award is bestowed to an individual for outstanding contributions over a period of years to the engineering profession and, in particular, to the field of fluids engineering through research, practice and/or teaching.","deadline":"September 30"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Frank-Kreith-Energy-Award\",\"Frank Kreith Energy Award\")","source":"ASME","eligibility":"The Frank Kreith Energy Award was established in 2005 to honor an individual for significant contributions to a secure energy future with particular emphasis on innovations in conservation and/or renewable energy. Contributions may be through research, education, practice or significant service to society that will lead to a sustainable energy future.","deadline":"December 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Literature-Awards/Freeman-Scholar-Award\",\"Freeman Scholar Award\")","source":"ASME","eligibility":"The Freeman Scholar Award Program is awarded annually.","deadline":"September 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Literature-Awards/Gas-Turbine-Award\",\"Gas Turbine Award\")","source":"ASME","eligibility":"","deadline":"June 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/George-Westinghouse-Medals\",\"George Westinghouse Medals\")","source":"ASME","eligibility":"The George Westinghouse Medals were established to recognize eminent achievement or distinguished service in the power field of mechanical engineering. The Silver Medal is bestowed upon one who is not yet 45 on June 30 of the year in which the medal is awarded. Considering power in the broad sense, the basis of the awards shall include contributions of utilization, application, design, development, research, and the organization of such activities in the power field.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Gustus-L-Larson-Memorial-Award\",\"Gustus L. Larson Memorial Award\")","source":"ASME","eligibility":"In 1938, Pi Tau Sigma (National Mechanical Engineering Honor Society) arranged with ASME for the joint award of the Pi Tau Sigma Gold Medal. This medal is awarded for outstanding achievement in mechanical engineering to an engineer within ten years after graduation from the regular engineering course of a recognized college or university.","deadline":"February 15"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/H-R-Lissner-Medal\",\"H.R. Lissner Medal\")","source":"ASME","eligibility":"The H.R. Lissner Medal recognizes outstanding achievements in the field of bioengineering. These achievements may be in the form of (1) significant research contributions in bioengineering; (2) development of new methods of measuring in bioengineering; (3) design of new equipment and instrumentation in bioengineering; and/or (4) educational impact in the training of bioengineers. In addition, successful nominees will have demonstrated significant service to the bioengineering community, in general, and to the Bioengineering Division of ASME, in particular.","deadline":"September 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Heat-Transfer-Memorial-Award\",\"Heat Transfer Memorial Award\")","source":"ASME","eligibility":"The Heat Transfer Memorial Award is bestowed on individuals who have made outstanding contributions to the field of heat transfer through teaching, research, practice, design, service, leadership, inventions, or a combination of such activities.\n\nOne award may be made annually in each of the three following categories: the science of heat transfer, the art of heat transfer, and the general subject of heat transfer. Each of the three categories of science, art and general is based on achievements through publications, patents and/or inventions, advancement of educational content and/or pedagogy, or exemplary community service with a focus on heat transfer. These can include but are not necessarily limited to the following:\n\nScience – Publication of results in professional journals, reports, books, peer-reviewed conference or symposium proceedings, and other such platforms, to establish substantive advancements in thermal science through analytical, computational, and/or experimental research. The research contributions are considered to be seminal, or breakthrough discoveries and/or processes, or significant advancement of prevailing science. This may also include science-related patents.\n\nArt – Significant contributions to the art and application of heat transfer engineering through design and development of heat transfer components and systems, and/or development and publication of heat transfer correlations for industrial applications, which have been implemented or are used in practice. Publication of applications-oriented results in heat transfer handbooks, design data books, and in other similar industry use platforms, including peer-reviewed journals. Development and practical implementation of economic analyses of heat transfer systems. Award of application-related patents; leadership in heat transfer related design or industrial product development; and other such appropriate achievements.\n\nGeneral – Extensive service to the mission of the ASME Heat Transfer Division (HTD) and its community. This may be reflected in exemplary volunteer leadership positions in HTD and ASME; as an editor or associate editor of an ASME heat transfer journal; in a proactive and impactful role in technical sessions at national and international conferences; in an impactful role in cross-division, cross-segment, and cross-sector activities of ASME and HTD. Leadership in student and early career mentoring, especially with heat transfer and ASME related activities. Publish nationally and/or internationally recognized and impactful (adopted, highly referenced, etc.) heat transfer textbooks or monographs or handbooks.\n\nEach nomination is to be submitted in only one of the three categories, and this should be so indicated a priori on the nomination form.\n\nThe Heat Transfer Memorial Award was established by the Heat Transfer Division in 1959 and operated as a division award until 1974 when it was elevated to a Society award.","deadline":"October 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Literature-Awards/Henry-Hess-Award\",\"Henry Hess Early Career Publication Award\")","source":"ASME","eligibility":"The Henry Hess Early Career Publication Award is given for best original technical paper presented to or published by the Society during the two calendar years prior to the year of award by an ASME Member. Joint authorship is permissible provided all authors meet the requirements. One of the authors must be an ASME Member. The paper shall be specifically recommended for the award by a review committee or qualified individual. The award was established in 1914 by Henry Hess, Member and Vice President of the Society. In 2016, the name was changed to the Henry Hess Early Career Publication Award.","deadline":"March 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Henry-Laurence-Gantt-Medal\",\"Henry Laurence Gantt Medal\")","source":"ASME","eligibility":"The Henry Laurence Gantt Medal, established in 1929 and elevated to a Society award in 1999,recognizes contributions to society in general and management in particular, through speeches, writings and teachings; civic responsibility, as shown by personal participation in community projects; the esteem in which his/her contemporaries in the community hold the nominee; not only distinguished achievement in management, but patterns set in inspiring others in accepting the responsibilities of citizenship; understanding and skill in the field of human relations; participation in and contribution to organizations related to the field of management; understanding the value of engineering to society.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Henry-R-Worthington-Medal\",\"Henry R. Worthington Medal\")","source":"ASME","eligibility":"The Henry R. Worthington Medal is bestowed for eminent achievement in the field of pumping machinery, systems and concepts. Such achievement may be, for example, in the areas of research, development, design, innovation, management, education or literature.","deadline":"September 30"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Holley-Medal\",\"Holley Medal\")","source":"ASME","eligibility":"The Holley Medal was established in 1924 to honor Alexander Lyman Holley, charter member of ASME. It is awarded for outstanding and unique act(s) of an engineering nature, accomplishing a noteworthy and timely public benefit by one or more individuals for a single achievement, provided the contributions are equal or comparable.","deadline":"March 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Honorary-Member\",\"Honorary Member\")","source":"ASME","eligibility":"Honorary Membership is awarded for a lifetime of service to engineering or related fields--e.g. science, research, public service. This achievement is described as \"distinguished service that contributes significantly to the attainment of the goals of the engineering profession.\" Ranking closely with Honorary Membership is the ASME Medal which is awarded for \"eminently distinguished engineering achievement.\"","deadline":"March 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Internal-Combustion-Engine-Award\",\"Internal Combustion Engine Award\")","source":"ASME","eligibility":"The Internal Combustion Engine Awardrecognizes eminent achievement or distinguished contribution over a substantial period of time, which may result from research, innovation, or education in advancing the art of engineering in the field of internal combustion engines; or in directing the efforts and accomplishments of those engaged in engineering practice in the design, development, application, and operation of internal combustion engines.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/J-P-Den-Hartog-Award\",\"J.P. Den Hartog Award\")","source":"ASME","eligibility":"The ASME J.P. Den Hartog Award recognizes lifetime contributions to the teaching and practice of vibration engineering.","deadline":"July 31 (even years)"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/J-Hall-Taylor-Medal\",\"J. Hall Taylor Medal\")","source":"ASME","eligibility":"The J. Hall Taylor Medal is presented for distinguished service or eminent achievement in the field of codes and standards pertaining to the broad fields of piping and pressure vessels which are sponsored or undertaken by ASME. The scope includes contributions to technical advancement and administration.","deadline":"November 15"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/James-Harry-Potter-Gold-Medal\",\"James Harry Potter Gold Medal\")","source":"ASME","eligibility":"The James Harry Potter Gold Medal recognizes eminent achievement or distinguished service in the science of thermodynamics and its application in mechanical engineering. The basis of the award shall include contributions involving the teaching, appreciation, or utilization of thermodynamic principles in research, development, and design in mechanical engineering.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/James-N-Landis-Medal\",\"James N. Landis Medal\")","source":"ASME","eligibility":"The James N. Landis Medal is presented for outstanding personal performance in the design, construction, or management of major steam-electric stations using nuclear or fossil fuels. The candidate must also demonstrate personal leadership in humanitarian pursuits, which may include committee activity, Section leadership, or the broad non-technical professional activity of the individual’s engineering society.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Johnson-Johnson-Consumer-Companies-Inc-Medal\",\"Johnson & Johnson Consumer Companies, Inc. Medal\")","source":"ASME","eligibility":"\n","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/about-asme/honors-awards/achievement-awards/lakshmi-singh-early-career-leadership-award\",\"Lakshmi Singh Early Career Leadership Award\")","source":"ASME","eligibility":"The Lakshmi Singh Early Career Leadership Award, established in 2020, recognizes an early-career woman engineer who has demonstrated considerable leadership in, commitment to, and continued service with ASME.","deadline":"March 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Kate-Gleason-Award\",\"Kate Gleason Award\")","source":"ASME","eligibility":"\n","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/M-Eugene-Merchant-Manufacturing-Medal-of-ASME-SME\",\"M. Eugene Merchant Manufacturing Medal of ASME/SME\")","source":"ASME","eligibility":"The M. Eugene Merchant Manufacturing Medal was established in 1986 by ASME and SME to honor an exceptional individual who has had significant influence and responsibility for improving the productivity and efficiency of the manufacturing operation.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Machine-Design-Award\",\"Machine Design Award\")","source":"ASME","eligibility":"The Machine Design Award recognizes eminent achievement or distinguished service in the field of machine design which is considered to include application, research, development, or teaching of machine design. In 1958, the Machine Design Division (now Design Engineering Division) established the award.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Marshall-B-Peterson-Award\",\"Marshall B. Peterson Award\")","source":"ASME","eligibility":"The Marshall B. Peterson Award is given in biennially in recognition of early-career achievement in research as demonstrated by papers published in scientific journals of ASME and promise for pursuit of research in tribology. It is preferred, but not required, that the awardee’s research emphasis be on materials aspects of tribology, e.g. wear, friction materials, and solid lubricants.","deadline":"February 1 (biennially)"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Mayo-D-Hersey-Award\",\"Mayo D. Hersey Award\")","source":"ASME","eligibility":"The Mayo D. Hersey Award is bestowed on an individual in recognition of distinguished and continued contributions over a substantial period of time to the advancement of the science and engineering of tribology. Distinguished contributions may result from significant original research in one or more of the many scientific disciplines related to lubrication, from excellence and creativity in lubrication engineering practice, or from sustained and forthright efforts and dissemination of information on the theory and practice of lubrication.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/McDonald-Mentoring-Award\",\"McDonald Mentoring Award\")","source":"ASME","eligibility":"The ASME McDonald Mentoring Award established in 2007 recognizes the outstanding mentoring of other professionals by an engineer in industry, government, education or private practice.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Literature-Awards/Melville-Medal\",\"Melville Medal\")","source":"ASME","eligibility":"The Melville Medal is the highest ASME honor for the best original paper (not published elsewhere) which has been published in the ASME Transactions during the two calendar years immediately preceding the year of the award. The paper may have more than one author, but one of the authors shall be an ASME corporate member (Fellow, Member or Associate Member). The paper shall be specifically recommended for the medal by a review committee or qualified individual.","deadline":"March 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Melvin-R-Green-Codes-Standards-Medal\",\"Melvin R Green Codes and Standards Medal\")","source":"ASME","eligibility":"The Melvin R. Green Codes and Standards Medal recognizes outstanding contributions to: (1) the development, promulgation, or management of documents, objects, or devices used in ASME programs of technical codification, standardization, and conformity assessment, or (2) the acceptance of ASME Codes and Standards within the United States or internationally.","deadline":"January 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Milton-C-Shaw-Manufacturing-Research-Medal\",\"Milton C. Shaw Manufacturing Research Medal\")","source":"ASME","eligibility":"The Milton C. Shaw Manufacturing Research Medal established in 2009, recognizes significant fundamental contributions to the science and technology of manufacturing processes.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Nadai-Medal\",\"Nadai Medal\")","source":"ASME","eligibility":"The Nadai Medal is awarded in recognition of significant contributions and outstanding achievements which broaden the field of materials engineering. Such achievements may be, for example, in the areas of education, research, development, and service to the field and profession.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Nancy-DeLoye-Fitzroy-and-Roland-V-Fitzroy-Medal\",\"Nancy DeLoye Fitzroy and Roland V. Fitzroy Medal\")","source":"ASME","eligibility":" ","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Sia-NematNasser-Early-Career-Award\",\"Nemat-Nasser Early Career Award\")","source":"ASME","eligibility":"The Sia Nemat-Nasser Early Career Award recognizes early career research excellence in the areas of experimental, computational, and theoretical mechanics and materials by young investigators who are within 10 years after their Ph.D. degree, with special emphasis placed on under-represented groups.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Old-Guard-Early-Career-Award\",\"Old Guard Early Career Award\")","source":"ASME","eligibility":"Established in 1994, this award recognizes outstanding early career engineers who have advanced quickly in their professional careers, have participated in advancing their education, have shown leadership in ASME activities and have volunteered actively in their communities.","deadline":"Old Guard Committee"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Old-Guard-Prizes\",\"Old Guard Prizes\")","source":"ASME","eligibility":"The Old Guard is made up of ASME dues exempt members, those who have reached the age of 65 and have retired. They continue to contribute to the Society and their contributions are used to support the \"Old Guard\" Prizes and similar Society activities related to Student and Early Career members.","deadline":"-"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Service-Awards/Student-Section-Advisor-Award\",\"Outstanding Student Section Advisor Award\")","source":"ASME","eligibility":"The Outstanding Student Section Advisor Award recognizes the leadership and service qualities of a Student Section Advisor who has completed at least 3 academic years as a Student Section Advisor prior to nomination for the award.","deadline":"N. Dyess"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Patrick-J-Higgins-Award\",\"Patrick J. Higgins Award\")","source":"ASME","eligibility":"Patrick J. Higgins Medal, established in 2007 to recognize an individual who has contributed to the enhancement of standardization through contributions to the development, and promotion of ASME Codes and Standards or Conformity Assessment Programs in the following areas: Plumbing Materials & Equipment; Screw Threads; Tools (machine, cutting and hand); Fasteners, (e.g, bolts, nuts, rivets, screws, washers);Chain, Attachments and Sprockets for Power Transmission & Conveying; Metal & Metal Alloy Wrought Mill Product Nominal Sizes; Pressure and Temperature Instruments & Accessories; Classification & Designation of Surface Qualities; Gage Blanks; Chemical Standard Pumps; Dimensional Metrology; Industrial System Energy Assessment; Overhead Hoists; Measurement of Fluid Flow in Closed Conduits; Reliability, Availability, and Maintainability of Power Plants; Steel Stacks; Verification and Validation in Computational Modeling and Simulation; Engineering Drawing; Related Documentation Practices.","deadline":"September 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Per-Bruel-Gold-Medal-for-Noise-Control-and\",\"Per Bruel Gold Medal for Noise Control and Acoustics\")","source":"ASME","eligibility":"The Per Bruel Gold Medal for Noise Control and Acoustics is given in recognition of eminent achievement and extraordinary merit in the field of noise control and acoustics. The achievement must include useful applications of the principles of noise control and acoustics to the art and science of mechanical engineering.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Performance-Test-Codes-Medal\",\"Performance Test Codes Medal\")","source":"ASME","eligibility":"The Performance Test Codes Medal is awarded to an individual (or individuals in exceptional circumstances) who has made outstanding contributions to the development and promotion of ASME Performance Test Codes, including the Supplements on Instruments and Apparatus.","deadline":"January 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Pi-Tau-Sigma-Gold-Medal\",\"Pi Tau Sigma Gold Medal\")","source":"ASME","eligibility":"The Pi Tau Sigma Gold Medal recognizes outstanding achievement in mechanical engineering within ten years following graduation with a baccalaureate (bachelors) degree in Mechanical Engineering or related field. The award is bestowed for overall outstanding achievement in the mechanical engineering field during the set period of time.","deadline":"February 15"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Literature-Awards/Prime-Movers-Committee-Award\",\"Prime Movers Committee Award\")","source":"ASME","eligibility":"The Prime Movers Committee Award recognizes outstanding contributions to the literature of thermal electric station practice or equipment which are available through public presentation and publication. Those papers approved by the appropriate papers review committee as meeting ASME standards and available in printed form may be considered for this award. Papers, while usually current need not necessarily be so, may be by a single author or multiple authors.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/R-Tom-Sawyer-Award\",\"R. Tom Sawyer Award\")","source":"ASME","eligibility":"Nomination Instructions","deadline":"August 30"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Ralph-Coats-Roe-Medal\",\"Ralph Coats Roe Medal\")","source":"ASME","eligibility":"The Ralph Coats Roe Medal, established in 1972, recognizes an outstanding contribution toward a better public understanding and appreciation of the engineer’s worth to contemporary society.","deadline":"September 15"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Richard-J-Goldstein-Lecture-Award\",\"Richard J. Goldstein Energy Lecture Award\")","source":"ASME","eligibility":"\n","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Robert-E-Koski-Medal\",\"Robert E. Koski Medal\")","source":"ASME","eligibility":"\n","deadline":"February 20"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Robert-Henry-Thurston-Lecture-Award\",\"Robert Henry Thurston Award\")","source":"ASME","eligibility":"The Robert Henry Thurston Lecture, established in 1925 in honor of ASME’s first president, provided an opportunity for a leader in pure and/or applied science or engineering to present to the Society a lecture on a subject of broad interest to engineers. The Thurston Lecture was elevated to a Society award in 2000.","deadline":"February 15"},{"award":"=HYPERLINK(\"https://www.asme.org/about-asme/honors-awards/achievement-awards/robert-nerem-education-mentorship-medal\",\"Robert M. Nerem Education and Mentorship Medal\")","source":"ASME","eligibility":"The Robert M. Nerem Education and Mentorship Medal is given to an individual who has demonstrated a sustained level of outstanding achievement in education and mentoring of trainees. Examples of meritorious activities include leadership within the nominee’s institution, mentoring activities that are above and beyond those expected from others employed in similar positions, mentoring activities tailored to meet the needs of the trainees, and innovative mentoring activities.","deadline":"September 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Rufus-Oldenburger-Medal\",\"Rufus Oldenburger Medal\")","source":"ASME","eligibility":"The Rufus Oldenburger Medal is a prestigious Society award for lifetime achievements in automatic control. Inaugurated in 1968, the medal recognizes significant contributions and outstanding achievements in the field of automatic control. Such achievements may be, for example, in the areas of education, research, development, innovation, and service to the field and profession.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Ruth-and-Joel-Spira-Outstanding-Design-Educator\",\"Ruth and Joel Spira Outstanding Design Educator Award\")","source":"ASME","eligibility":"The Ruth and Joel Spira Outstanding Design Educator Award was established as a division award in 1998. The Award was elevated to a Society award in 2001 to recognize a person who exemplifies the best in furthering engineering design education through vision, interactions with students and industry, scholarship and impact on the next generation of engineers, and a person whose action serves as a role model for other educators to emulate.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/S-Y-Zamrik-PVP-Medal\",\"S.Y. Zamrik Pressure Vessels and Piping Award\")","source":"ASME","eligibility":"The S.Y. Zamrik PVP Medal is bestowed for outstanding contributions in the field of pressure vessel and piping technology including, but not limited to, research, development, teaching, and significant advancements of the state-of-the-art.","deadline":"June 15"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Safety-Codes-Standards-Medal\",\"Safety Codes and Standards Medal\")","source":"ASME","eligibility":"The Safety Codes and Standards Medal is presented to one or more individuals who have contributed to the enhancement of public safety through the development and promotion of ASME codes and standards or the ASME safety accreditation activity.","deadline":"January 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Savio-LY-Woo-Translational-Biomechanics-Medal\",\"Savio L-Y. Woo Translational Biomechanics Medal\")","source":"ASME","eligibility":"The Savio L-Y. Woo Medal is bestowed upon an individual who has translated meritorious bioengineering science to clinical practice through research, education, professional development, and with service to the bioengineering community.","deadline":"September 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Soichiro-Honda-Medal\",\"Soichiro Honda Medal\")","source":"ASME","eligibility":"The Soichiro Honda Medal recognizes an individual for an outstanding achievement or a series of significant engineering contributions in developing improvements in the field of personal transportation.","deadline":"October 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Spirit-of-St-Louis-Medal\",\"Spirit of St. Louis Medal\")","source":"ASME","eligibility":"The Spirit of St. Louis Medal is awarded for meritorious service in the advancement of aeronautics and astronautics.","deadline":"January 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Thomas-A-Edison-Patent-Award\",\"Thomas A. Edison Patent Award\")","source":"ASME","eligibility":"The Thomas A. Edison Patent Award, established in 1997, recognizes creativity of a patented device or process that has the potential of significantly enhancing some aspect of mechanical engineering.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Timoshenko-Medal\",\"Timoshenko Medal\")","source":"ASME","eligibility":"The Timoshenko Medal was established in 1957 and is conferred in recognition of distinguished contributions to the field of applied mechanics. Instituted by the Applied Mechanics Division, it honors Stephen P. Timoshenko, world-renowned authority in the field, and it commemorates his contributions as author and teacher.","deadline":"September 15th"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Thomas-K-Caughey-Dynamics-Medal\",\"Thomas K. Caughey Dynamics Medal\")","source":"ASME","eligibility":"Nomination Instructions","deadline":"September 15"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Van-C-Mow-Medal\",\"Van C. Mow Medal\")","source":"ASME","eligibility":"The Van C. Mow Medal is bestowed upon an individual who has demonstrated meritorious contributions to the field of bioengineering through research, education, professional development, leadership in the development of the profession, mentorship to young bioengineers, and with service to the bioengineering community.","deadline":"September 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Warner-T-Koiter-Medal\",\"Warner T. Koiter Medal\")","source":"ASME","eligibility":"The Warner T. Koiter Medal, established in 1996, is bestowed in recognition of distinguished contributions to the field of solid mechanics with special emphasis on the effective blending of theoretical and applied elements of the discipline, and on a high degree of leadership in the international solid mechanics community.","deadline":"September 15th"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Wilfred-LaRochelle-Conformity-Assessment-Award\",\"Wilfred C. LaRochelle Conformity Assessment Award\")","source":"ASME","eligibility":"The Wilfred C. LaRochelle Conformity Assessment Award, established in 2017, recognizes distinguished service in the area of conformity assessment including, but not limited to, the establishment, advancement and promotion of the Society’s product & personnel certification and accreditation programs.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/William-T-Ennor-Manufacturing-Technology-Award\",\"William T. Ennor Manufacturing Technology Award\")","source":"ASME","eligibility":"The William T. Ennor Manufacturing Technology Award is presented to an individual or team of individuals for developing or contributing significantly to an innovative manufacturing technology, the implementation of which has resulted in substantial economic and/or societal benefits.","deadline":"February 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Literature-Awards/Worcester-Reed-Warner-Medal\",\"Worcester Reed Warner Medal\")","source":"ASME","eligibility":"The Worcester Reed Warner Medal is awarded to an individual for seminal contribution to the permanent literature of engineering. Single papers, treatises, books or series of papers, and digital media may be considered.  Works should be highly influential to a generation of engineers, and not exclusively the result of a prolific career. Works considered may deal with progressive ideas relative to engineering; the design and operation of mechanical and associated equipment; industrial engineering or management organization, operation and the concomitants of each; and other subjects closely associated with the foregoing.","deadline":"March 1"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Y-C-Fung-Young-Investigator-Award\",\"Y.C. Fung Early Career Award\")","source":"ASME","eligibility":"Established to recognize young investigators who are committed to pursuing research in the field of Bioengineering and have demonstrated significant potential to make substantial contributions to the field of Bioengineering. Such accomplishments may take the form of, but are not limited to, design or development of new methods, equipment or instrumentation in bioengineering; and research publications in peer-reviewed journals.","deadline":"September 1 to Award Chair"},{"award":"=HYPERLINK(\"https://www.asme.org/About-ASME/Honors-Awards/Achievement-Awards/Yeram-S-Touloukian-Award\",\"Yeram S. Touloukian Award\")","source":"ASME","eligibility":"The Yeram S. Touloukian Award, established in 1997, is bestowed triennially to recognize outstanding technical contributions in the field of thermophysical properties. An individual who is internationally recognized for major contributions in the thermophysical properties field is eligible to receive this award. Fields recognized by the award include, but are not limited to, mechanical engineering, chemical engineering, physics and chemistry.","deadline":"September 1st - of the year before the Symposium on Thermophysical Properties."}]